{
      "description" : "The first Episode of I'm Gonna Eat Your Lunch just released and is now available on iTunes in HD for instant download. It took the better part of 2 years to create and while it's as ambitious as many independent short films, we envision a TV show format with a regular release schedule. The team is in place. We have 3 sets in 2 locations, including a warehouse that we're renting, 3 audio producers, a full cast of voiceover actors, an excellent puppet designer, a seasoned editor, 2 motion graphics artists, amazing puppeteers, commercial cameramen. It's an amazing team and we've come a long way in large part through the tremendous voluntarism and work ethic everyone put forth to make the first episode. Even so, we self-funded the first episode to the tune of $40k. Fortunately, many of those expenses are non-recurring (such as the design of the main sets and puppets). With your help we won't have to work all week to earn the money to shoot for the nights and weekend. We think our work speaks for itself, but we don't think the one episode we completed will be sufficient to get us out of the hole and enable us to produce subsequent episodes. That takes time, positive reviews, audience outreach and merchandising. We're not there yet, but we've come a long way and we think we have a fun, smartly written show on our hands. Seriously, there's a dozen decent cartoons on TV today that are geared for teenagers on up. That's because it's become a lot less expensive to animate than to produce a show such as IGEYL. But it's an art form we want to preserve; one with a unique look and feel that is both nostalgic and underrepresented in popular media today. Most of all we love to make you laugh. The biggest challenges we overcame in making the first episode involved the unknown. While a couple of the puppeteers had formal training and TV or film credits, we really had to learn how to do this as we went. It helped us to improve our process and innovate. Basically, we've already got a proven track record of overcoming adversity. When we began we were a few friends with a script and a proof of concept. Now, we're a much more seasoned group with more creative resources. It's always a risk when a key contributor has to drop out, but we've been there and we've done that and now we're here. We have a new script that's even stronger and with our first episode now complete - you don't have to take our word for it. Proof's in the pudding.", 
      "videoName" : "attlassian1.avi",
      "imageName" : "attlassian1.png",
      "key_metrics" :[
        {
          "label":"2012 REVENUES",
          "data":"3 M$"
        },
        {
          "label":"KEY ASSET",
          "data":"Multi-Use Device"
        },
        {
          "label":"TOP CLIENT",
          "data":"America's CUP"
        }
      ],
    "id" : 1,
    "version" : 1
  }